<!-- terraform-plan-comment -->
### 📦 Terraform Plan Result
```
module.lambda_trigger.data.archive_file.join_trigger_zip: Reading...
module.lambda_trigger.data.archive_file.join_trigger_zip: Read complete after 0s [id=944430d003963720d1934ccef4f12a8ccc35f8eb]
data.aws_availability_zones.available: Reading...
module.lambda_trigger.aws_cloudwatch_event_rule.s3_trigger: Refreshing state... [id=trigger-worker-join]
module.worker_node_iam.aws_iam_role.master_node_ec2: Refreshing state... [id=worker-node-role]
aws_vpc.k8s: Refreshing state... [id=vpc-086e52a33a864ff2e]
module.master_node_iam.aws_iam_role.master_node_ec2: Refreshing state... [id=master-node-role]
module.lambda_trigger_iam.aws_iam_role.master_node_ec2: Refreshing state... [id=lambda-trigger-role]
module.bootstrap_bucket.aws_s3_bucket.worker_node_token: Refreshing state... [id=k8s-bootstrap-artifacts]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.worker_node_iam.aws_iam_role_policy.master_node_ec2_policy: Refreshing state... [id=worker-node-role:WorkerNodePolicy]
module.worker_node_iam.aws_iam_instance_profile.master_node_ec2_instance_profile: Refreshing state... [id=worker-node-role-profile]
module.master_node_iam.aws_iam_instance_profile.master_node_ec2_instance_profile: Refreshing state... [id=master-node-role-profile]
module.master_node_iam.aws_iam_role_policy.master_node_ec2_policy: Refreshing state... [id=master-node-role:MasterNodePolicy]
module.bootstrap_bucket.aws_s3_bucket_public_access_block.worker_node_token_access: Refreshing state... [id=k8s-bootstrap-artifacts]
module.lambda_trigger_iam.aws_iam_instance_profile.master_node_ec2_instance_profile: Refreshing state... [id=lambda-trigger-role-profile]
module.lambda_trigger_iam.aws_iam_role_policy.master_node_ec2_policy: Refreshing state... [id=lambda-trigger-role:LambdaTriggerPolicy]
aws_internet_gateway.k8s: Refreshing state... [id=igw-02524fe0cc2fa7c0a]
aws_subnet.public[1]: Refreshing state... [id=subnet-091c91645e010625b]
aws_subnet.public[0]: Refreshing state... [id=subnet-03db3655b617f6817]
aws_subnet.public[2]: Refreshing state... [id=subnet-0e00b538d8010a536]
aws_security_group.k8s: Refreshing state... [id=sg-01bf9bc28bfba67cd]
aws_route_table.k8s: Refreshing state... [id=rtb-0bd02e70a9a3f5884]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07b4e6a9230757cb9]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d3b36ef6c734995b]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-09cd4354b96a4dbdd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.lambda_trigger.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "trigger-worker-join"
      + target_id      = "TriggerLambda"
    }

  # module.lambda_trigger.aws_lambda_function.join_trigger will be created
  + resource "aws_lambda_function" "join_trigger" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "modules/lambda_trigger/join_worker_node.zip"
      + function_name                  = "trigger-worker-join"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::354799575718:role/lambda-trigger-role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Qh2iGZnlQhDuRIA63ZJakybuoUUTo/j7sKVTdZxMPr0="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "S3_BUCKET" = "k8s-bootstrap-artifacts"
              + "S3_KEY"    = "join-command.txt"
            }
        }
    }

  # module.lambda_trigger.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "trigger-worker-join"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:us-east-1:354799575718:rule/trigger-worker-join"
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda_trigger_iam.aws_iam_role.master_node_ec2 will be updated in-place
  ~ resource "aws_iam_role" "master_node_ec2" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = "ec2.amazonaws.com" -> "lambda.amazonaws.com"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "lambda-trigger-role"
        name                  = "lambda-trigger-role"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lambda_trigger_iam.aws_iam_role_policy.master_node_ec2_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "master_node_ec2_policy" {
        id     = "lambda-trigger-role:LambdaTriggerPolicy"
        name   = "LambdaTriggerPolicy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                            "s3:GetObject",
                          + "ec2:DescribeInstances",
                            "ssm:SendCommand",
                            "ssm:GetCommandInvocation",
                          - "ec2:DescribeInstances",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```